{
  "name": "Eslam ElMeniawy",
  "profession": "Mobile Team Lead",
  "workExperience": [
    {
      "job": "Mobile Team Lead",
      "company": "Ejada",
      "date": "Aug 2023 - Present",
      "details": [
        "Led cross-functional collaboration with product management to define customer requirements and deliver product roadmap alignment.",
        "Spearheaded full software development lifecycle from requirements gathering through deployment across all mobile platforms.",
        "Mentored junior engineers through technical guidance, code reviews, and career development initiatives.",
        "Resolved team conflicts and fostered a high-performing culture through constructive feedback and technical excellence.",
        "Established and enforced code quality standards, ensuring adherence to architectural best practices across all projects.",
        "Delivered mobile solutions within aggressive timelines while maintaining product quality and team morale.",
        "Managed project timelines, resource allocation, and stakeholder expectations to ensure on-time delivery."
      ]
    },
    {
      "job": "Sr. Mobile Software Engineer and Team Lead",
      "company": "RoQay",
      "date": "Sep 2018 - Jul 2023",
      "details": [
        "Led mobile engineering team through design, development, and deployment of React Native, Android, and iOS applications.",
        "Architected reusable component libraries and development templates, reducing feature delivery time by standardizing development patterns.",
        "Partnered with business and design teams to translate requirements into technical specifications and product features.",
        "Managed publication and lifecycle of applications across Google Play and Apple App Store, maintaining developer accounts and compliance.",
        "Developed full-stack mobile solutions using React Native, JavaScript, TypeScript, Java, Kotlin, and Swift across multiple platforms.",
        "Established intern training program, developing junior engineers into productive team contributors with industry-standard practices.",
        "Optimized system performance and stability through continuous monitoring, debugging, and infrastructure improvements.",
        "Championed adoption of new technologies and best practices, keeping the team current with industry developments."
      ]
    },
    {
      "job": "Sr. Mobile Software Engineer",
      "company": "MicroDoers",
      "date": "Mar 2016 - Sep 2018",
      "details": [
        "Developed native Android and iOS applications using Java and Swift, delivering production-quality mobile solutions.",
        "Architected and implemented continuous integration and continuous deployment pipelines, accelerating release cycles.",
        "Designed and executed automated test suites using Appium, improving code reliability and reducing manual QA effort.",
        "Debugged complex mobile application issues, optimizing performance and stability across devices and OS versions."
      ]
    },
    {
      "job": "Mobile Software Engineer",
      "company": "CITC",
      "date": "Nov 2015 - Sep 2018",
      "details": [
        "Developed native (Java/Swift) and cross-platform (Cordova) mobile applications for diverse client requirements.",
        "Published and maintained applications on Google Play and Apple App Store, managing developer accounts and release processes.",
        "Presented technical solutions and product demonstrations to clients and stakeholders, securing buy-in and feedback.",
        "Maintained system performance and stability through proactive monitoring and continuous optimization."
      ]
    },
    {
      "job": "Mobile Software Engineer",
      "company": "MT",
      "date": "May 2014 - Oct 2015",
      "details": [
        "Designed and deployed cross-platform mobile applications using Cordova framework.",
        "Stayed current with emerging technologies and development trends to deliver modern solutions."
      ]
    },
    {
      "job": "Android Application Developer",
      "company": "EGIT",
      "date": "Oct 2013 - Apr 2014",
      "details": ["Developed native Android applications in Java, building foundational expertise in mobile development."]
    }
  ],
  "education": [
    {
      "degree": "B.Sc. Software Engineering",
      "place": "Mansoura University, Egypt",
      "date": "2008 - 2013"
    }
  ],
  "skills": [
    "Android Development",
    "Kotlin",
    "Java",
    "ReactNative Development",
    "JavaScript",
    "TypeScript",
    "Redux",
    "iOS Development",
    "Swift",
    "Leadership",
    "Git",
    "Teamwork",
    "Creativity",
    "Automation Testing",
    "Scrum",
    "Azure",
    "Continuous Integration"
  ],
  "languages": [
    { "name": "Arabic", "experience": "Native / Bilingual Proficiency" },
    { "name": "English", "experience": "Professional Working Proficiency" }
  ]
}
